Autodesk.Revit.DB.AutomaticConnectionBehaviorType
Defines behavior of connector with respect to automatic creation of connections
Enumeration of automatic connection behavior types

Autodesk.Revit.DB.AutomaticConnectionBehaviorType.Full
Connector may participate in automatic connection, but at the moment it is fully connected

Autodesk.Revit.DB.AutomaticConnectionBehaviorType.Accepting
Connector accepts more automatic connections if needed, but

Autodesk.Revit.DB.AutomaticConnectionBehaviorType.Forced
Connector must establish a connection

Autodesk.Revit.DB.AutomaticConnectionBehaviorType.Active
Connector is actively looking to be connected

Autodesk.Revit.DB.AutomaticConnectionBehaviorType.Exclude
Connector does not participate in automatic connection